# DuplicateParamName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..DuplicateParamName Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Family parameters have duplicate names.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateParamName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateParamName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateParamName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace